In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [37]:
df = pd.read_csv('./test.csv', converters={'Locations': pd.eval})
df.head(5)

,ID,Seller,Category,Locations,Price,Currency,Rooms,Area,Floor
0,2911819,Owner,Kohna tikili,[Narimanov r.],205000,AZN,3,90.0,2
1,2913784,Agentlik,Yeni tikili,"[Ahmadli m., Xatai r.]",95000,AZN,2,65.0,3
2,2888440,Owner,Yeni tikili,"[Xatai r., Hazi Aslanov q.]",144500,AZN,3,120.0,2
3,2127952,Owner,Yeni tikili,[Nasimi r.],434000,AZN,3,155.0,16
4,2916563,Agentlik,Yeni tikili,[Sabail r.],158000,AZN,3,102.0,5

In [38]:
df['Locations'].explode().value_counts()

Nasimi r.                63
Yasamal r.               58
Xatai r.                 46
Narimanov r.             31
Binaqadi r.              30
Nizami r.                21
Yeni Yasamal q.          18
Memar Acami m.           15
Yasamal q.               14
20 Yanvar m.             14
Nariman Narimanov m.     13
Inshaatchilar m.         12
Sabail r.                12
Elmlar Akademiyasi m.    12
Hazi Aslanov m.          12
Ahmadli q.               11
Qara Qarayev m.          10
Shah Ismayil Xatai m.    10
7-ci mikrorayon q.       10
8-ci kilometr q.          8
Absheron r.               7
Hazi Aslanov q.           7
Ahmadli m.                7
Sabunchu r.               6
Suraxani r.               6
8 Noyabr m.               6
9-cu mikrorayon q.        6
Masazir q.                6
Nizami m.                 5
1-ci mikrorayon q.        5
Yeni Gunashli q.          5
Xalqlar Dostlugu m.       5
28 May m.                 4
6-ci mikrorayon q.        3
Nasimi m.                 3
Bayil q.                  3
8-ci mikrorayon q.        3
Badamdar q.               3
Ganclik m.                3
Ichari Shahar m.          3
Nardaran q.               3
Avtovagzal m.             2
Bakixanov q.              2
Bilacari q.               2
3-cu mikrorayon q.        2
Kubinka q.                2
Azadliq Prospekti m.      1
Ag shahar q.              1
4-cu mikrorayon q.        1
Amircan q.                1
M.A.Rasulzada q.          1
Sulutapa q.               1
5-ci mikrorayon q.        1
Novxani q.                1
Darnagul m.               1
Neftchilar m.             1
Sabunchu q.               1
Name: Locations, dtype: int64

In [40]:
# df.loc[df['Currency'] == 'USD', 'Price'] = df['Price']*1.7
# df.loc[df['Currency'] == 'USD', 'Currency'] = 'AZN'
df['Currency'].unique()

array(['AZN'], dtype=object)

In [42]:
df.describe()

                 ID         Price       Rooms           Area       Floor
count  2.800000e+02  2.800000e+02  280.000000     280.000000  280.000000
mean   2.842919e+06  1.915312e+05    2.878571     590.596429    7.482143
std    1.480542e+05  1.477910e+05    0.961390    8061.466527    4.879887
min    2.077223e+06  2.400000e+04    1.000000      30.000000    1.000000
25%    2.850157e+06  1.092500e+05    2.000000      67.750000    4.000000
50%    2.900556e+06  1.497500e+05    3.000000     100.000000    6.000000
75%    2.914415e+06  2.450000e+05    3.000000     135.000000   10.000000
max    2.916563e+06  1.685754e+06    7.000000  135000.000000   23.000000

In [46]:
df.loc[df['Area'] == max(df['Area'])]

,ID,Seller,Category,Locations,Price,Currency,Rooms,Area,Floor
207,2916443,Owner,Yeni tikili,"[Yasamal r., Yeni Yasamal q.]",112000,AZN,3,135000.0,9